ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Reports/vs_СтруктураСерииНоменклатуры/vs_СтруктураСерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>vs_СтруктураСерииНоменклатуры</name>
</mdclass:Report>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cc2a9ed0-e83e-4ca4-a99c-1b3eefba4d77">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="05872603-77e1-4a65-9640-5c837cae0d4b">
  <name>ВыпускПродукции</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1432ebad-0512-4bf0-9084-70f108bd1420">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="323a9cd4-308a-4174-89c3-859201c84774">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="32a8ad5a-7bb0-4e1f-9757-0e453c0b4e81">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f066de91-eb28-425d-a1b7-5c42c8dbdb5c">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d57bb551-19ad-4917-8420-67041271717c">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/РаспределениеПроизводственныхЗатрат/РаспределениеПроизводственныхЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7ecdbd0d-7dbf-443d-af41-e9cde537fb1b">
  <name>РаспределениеПроизводственныхЗатрат</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="17b47a19-6cb8-4c45-ad45-3c208dc175ea">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="1047dac4-4748-4e76-8492-e58af2253493">
    <name>ПартииПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9986a210-c34d-4837-a67c-2a6e12914b0b">
      <name>ПартияПроизводства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="040cd276-3c02-4801-9b6b-dd5273b5bb05">
    <name>ВидыЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1212094a-2544-4ac4-84b6-e967526ab10a">
      <name>ПартияПроизводства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/СписаниеЗатратНаВыпуск/СписаниеЗатратНаВыпуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="037b9e14-f05f-4ce9-af2f-8373fdce15b3">
  <name>СписаниеЗатратНаВыпуск</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="440bea18-6801-47b8-a34e-fb17530618a4">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="90e1b6bf-c7f7-4a34-889f-16c1495dddae">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2be15f06-e478-4c67-985e-49a4cdf8d1ce">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8f2f6a8d-a193-4bc6-b590-18ccfd1dbcc3">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="870aecc5-5671-4189-a43b-432a807eedf8">
    <name>ВозвратныеОтходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="433963e3-bc6c-4ffb-a78b-1182b8ceb65f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3cc159d9-4589-429a-99fb-500d0b8624f3">
      <name>Распоряжение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="96405585-4507-4629-a76d-8405ab8a426b">
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5bd93738-6272-4420-8100-dfd2e4f2e68d">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/СборкаТоваров/СборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="600ea876-962e-4c78-bacb-7368e2d7bd87">
  <name>СборкаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes extendedConfigurationObject="e7d6af32-9bc6-40c2-b3f1-f5d16ad67df9">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="660a4c7d-a983-455d-8258-5307371c13f8">
    <name>ЗаказНаСборку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b16013d8-0227-4894-95d4-41b953964e2b">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="52b01363-8774-4cb2-a192-b4017c48be6b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a25e3b0c-2647-4c12-aa53-991fe77955a6">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовить</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes>
    <name>vs_СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bab1076-c626-4662-b814-ed3a1973efb8">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e12d08bd-1d79-40a7-b21c-f669b1a7094b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ЭтоДоизготовление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a7dbbbcd-b6fb-4d47-96b7-edcd8cf2d437">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДоизготовить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Reports/vs_СтруктураСерииНоменклатуры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - См. ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.РазрешеноИзменятьВарианты = Ложь;
//#Вставка
	Настройки.РазрешеноИзменятьВарианты = Истина;
//#КонецВставки
	
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Подробнее - см. ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	
	Отчет = ЭтаФорма.Отчет;
	КомпоновщикНастроекФормы = Отчет.КомпоновщикНастроек; // КомпоновщикНастроекКомпоновкиДанных - 
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
		ЗначениеПоиска = Новый ПараметрКомпоновкиДанных("Номенклатура");
		Для каждого ЭлементПараметр Из КомпоновщикНастроекФормы.Настройки.ПараметрыДанных.Элементы Цикл
			Если ЭлементПараметр.Параметр = ЗначениеПоиска Тогда
				ЭлементПараметр.ПредставлениеПользовательскойНастройки = НСтр("ru = 'Комплект'");
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НовыеНастройкиКД = КомпоновщикНастроекФормы.Настройки;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	ОтборНоменклатура = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Номенклатура").Значение;
	ОтборСерия = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Серия").Значение;
	
	Если НЕ ЗначениеЗаполнено(ОтборНоменклатура) Тогда
		Если ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
			ТекстСообщения = НСтр("ru = 'Поле ""Продукция или полуфабрикат"" не заполнено.'");
		Иначе
			ТекстСообщения = НСтр("ru = 'Поле ""Комплект"" не заполнено.'");
		КонецЕсли; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ОтборСерия) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Серия"" не заполнено.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	#Область Инициализация
	ИспользоватьПроизводство = ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство");
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Номенклатура", КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Номенклатура").Значение);
	ПараметрыОтчета.Вставить("Характеристика", КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Характеристика").Значение);
	ПараметрыОтчета.Вставить("Серия", КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Серия").Значение);
//#Вставка
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_СтруктураСерииНоменклатурыСЦеной" Тогда
		ВидЦеныПараметр = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "ВидЦены");
		ВидЦены = ВидЦеныПараметр.Значение;
		Если ВидЦеныПараметр.Использование и ЗначениеЗаполнено(ВидЦены) Тогда
			ПараметрыОтчета.Вставить("ВидЦены", ВидЦены);
		КонецЕсли;
	КонецЕсли;
//#КонецВставки
	
	ПревышенЛимитСтрок = Ложь;
	СтруктураСерииДерево = СтруктураСерииНоменклатуры(ПараметрыОтчета, ПревышенЛимитСтрок);
	
//#Удаление
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.СтруктураСерииНоменклатуры.ПФ_MXL_СтруктураСерииНоменклатуры");
//#КонецУдаления
//#Вставка
	ОбработатьСтрокиД(СтруктураСерииДерево.Строки);
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_СтруктураСерииНоменклатурыСЦеной" и ПараметрыОтчета.Свойство("ВидЦены") Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.vs_СтруктураСерииНоменклатуры.ПФ_MXL_СтруктураСерииНоменклатурыСЦеной");
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.vs_СтруктураСерииНоменклатуры.ПФ_MXL_СтруктураСерииНоменклатуры");   // fix СтруктураСерииНоменклатуры -> vs_СтруктураСерииНоменклатуры
	КонецЕсли;
//#КонецВставки
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметры = Макет.ПолучитьОбласть("Параметры");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПредупреждение = Макет.ПолучитьОбласть("Предупреждение");
	#КонецОбласти
	
	// Вывод области Заголовок
	#Область ОбластьЗаголовок
//#Удаление
//	ПараметрыОбласти = Новый Структура("ТекстЗаголовка", НСтр("ru = 'Структура серии номенклатуры'", ОбщегоНазначения.КодОсновногоЯзыка()));
//#КонецУдаления
//#Вставка
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_СтруктураСерииНоменклатурыСЦеной" и ПараметрыОтчета.Свойство("ВидЦены") Тогда
		ПараметрыОбласти = Новый Структура("ТекстЗаголовка", НСтр("ru = 'Текущие затраты на изделие по номенклатуре с ценой (vssoft)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Иначе
		ПараметрыОбласти = Новый Структура("ТекстЗаголовка", НСтр("ru = 'Текущие затраты на изделие по номенклатуре (vssoft)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КонецЕсли;
//#КонецВставки
	ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбласти);
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	#КонецОбласти
	
	// Вывод области Предупреждение
	#Область ОбластьПредупреждение
	Если ПревышенЛимитСтрок Тогда
		ПараметрыОбласти = Новый Структура("КоличествоСтрок", ЛимитСтрок());
		ОбластьПредупреждение.Параметры.Заполнить(ПараметрыОбласти);
		ДокументРезультат.Вывести(ОбластьПредупреждение);
	КонецЕсли;
	#КонецОбласти
	
	// Вывод области Параметры
	#Область ОбластьПараметры
	ПараметрыОбласти = Новый Структура;
	ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
										Строка(ПараметрыОтчета.Номенклатура), 
										Строка(ПараметрыОтчета.Характеристика));
										
	ПараметрыОбласти.Вставить("ОтборНоменклатура", ПредставлениеНоменклатуры);
	ПараметрыОбласти.Вставить("ОтборСерия", Строка(ПараметрыОтчета.Серия));
	Если ИспользоватьПроизводство Тогда
		ПараметрыОбласти.Вставить("ТекстПродукция", НСтр("ru = 'Продукция или полуфабрикат'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Иначе
		ПараметрыОбласти.Вставить("ТекстПродукция", НСтр("ru = 'Комплект'"));
	КонецЕсли;
//#Вставка
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_СтруктураСерииНоменклатурыСЦеной" и ПараметрыОтчета.Свойство("ВидЦены") Тогда
		ПараметрыОбласти.Вставить("ОтборВидЦены", ПараметрыОтчета.ВидЦены);
	КонецЕсли;
//#КонецВставки
	ОбластьПараметры.Параметры.Заполнить(ПараметрыОбласти);
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	ДокументРезультат.Вывести(ОбластьПустаяСтрока, 1,, Истина);
	ДокументРезультат.Вывести(ОбластьПараметры, 2,, Истина);
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
	ДокументРезультат.Вывести(ОбластьПустаяСтрока);
	#КонецОбласти
	
	// Вывод области Шапка
	#Область ОбластьШапка
	ПараметрыОбласти = Новый Структура;
	Если ИспользоватьПроизводство Тогда
		ПараметрыОбласти.Вставить("ТекстМатериал", НСтр("ru = 'Полуфабрикат или материал'", ОбщегоНазначения.КодОсновногоЯзыка()));
		ПараметрыОбласти.Вставить("ТекстИзрасходовано", НСтр("ru = 'Израсходовано'", ОбщегоНазначения.КодОсновногоЯзыка()));
	Иначе
		ПараметрыОбласти.Вставить("ТекстМатериал", НСтр("ru = 'Комплектующая'", ОбщегоНазначения.КодОсновногоЯзыка()));
		ПараметрыОбласти.Вставить("ТекстИзрасходовано", НСтр("ru = 'Израсходовано'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КонецЕсли;
//#Вставка
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_СтруктураСерииНоменклатурыСЦеной" и ПараметрыОтчета.Свойство("ВидЦены") Тогда
		ПараметрыОбласти.Вставить("ОтборВидЦены", ПараметрыОтчета.ВидЦены);
	КонецЕсли;
//#КонецВставки
	ОбластьШапка.Параметры.Заполнить(ПараметрыОбласти);
	ДокументРезультат.Вывести(ОбластьШапка);
	#КонецОбласти
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	ЗаполнитьСтрокиРекурсивно(СтруктураСерииДерево, ОбластьСтрока, 0, ДокументРезультат);
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
//#Вставка
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_СтруктураСерииНоменклатурыСЦеной" и ПараметрыОтчета.Свойство("ВидЦены") Тогда 
		ОбластьИтого = Макет.ПолучитьОбласть("Итого");
        ПараметрыОбласти = Новый Структура("Сумма", СтруктураСерииДерево.Строки.Итог("Сумма"));
		ОбластьИтого.Параметры.Заполнить(ПараметрыОбласти);
		ДокументРезультат.Вывести(ОбластьИтого);
	КонецЕсли;
//#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураСерииНоменклатуры(Параметры, ПревышенЛимитСтрок)
	
	СтруктураСерииНоменклатурыДерево = Новый ДеревоЗначений;
//#Вставка
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("НоменклатураКод", Новый ОписаниеТипов("Строка"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число")); 
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
//#КонецВставки
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Израсходовано", Новый ОписаниеТипов("Число"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("Строка"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("НоменклатураПредставление", Новый ОписаниеТипов("Строка"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("СерияПредставление", Новый ОписаниеТипов("Строка"));
	
	СтруктураСерииКоллекция = СтруктураСерииНоменклатурыДерево.Строки;
	
	СписокНоменклатуры = Новый ТаблицаЗначений; // см. ПроизводствоСервер.СлужебнаяСтруктураТаблицыЗначений
	СписокНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СписокНоменклатуры.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	СписокНоменклатуры.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
//#Вставка
	//СписокНоменклатуры.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
//#КонецВставки
	СписокНоменклатуры.Колонки.Добавить("Строки");
	
	НоваяСтрока = СписокНоменклатуры.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры);
	НоваяСтрока.Строки = СтруктураСерииКоллекция;
	
	ОтборПоХарактеристике = ЗначениеЗаполнено(Параметры.Характеристика);
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПоиска = Новый Структура("НоменклатураСписка, ХарактеристикаСписка, СерияСписка");
	КоличествоСтрок = 0;
	ЛимитСтрок = ЛимитСтрок();
	
	Пока СписокНоменклатуры.Количество() <> 0 Цикл
		
		НовыйСписокНоменклатуры = СписокНоменклатуры.СкопироватьКолонки();
		
//#Удаление
		//ИспользованныеСерии = ИспользованныеСерии(СписокНоменклатуры, ОтборПоХарактеристике);
//#КонецУдаления		
//#Вставка
		ИспользованныеСерии = ИспользованныеСерии(СписокНоменклатуры, ОтборПоХарактеристике, ?(Параметры.Свойство("ВидЦены"),Параметры.ВидЦены,Неопределено));
//#КонецВставки
		
		ИспользованныеСерии.Индексы.Добавить("НоменклатураСписка, ХарактеристикаСписка, СерияСписка");
		
		Если НЕ ОтборПоХарактеристике Тогда
			
			ОтборПоХарактеристике = Истина;
			
			СписокНоменклатуры.Очистить();
			
			Колонки = "НоменклатураСписка, ХарактеристикаСписка, СерияСписка";
			ИспользованныеСерииКопия = ИспользованныеСерии.Скопировать(, Колонки);
			ИспользованныеСерииКопия.Свернуть(Колонки);
			
			Для каждого Строка Из ИспользованныеСерииКопия Цикл
				
				НоваяСтрока = СписокНоменклатуры.Добавить();
				НоваяСтрока.Номенклатура = Строка.НоменклатураСписка;
				НоваяСтрока.Характеристика = Строка.ХарактеристикаСписка;
				НоваяСтрока.Серия = Строка.СерияСписка;
				НоваяСтрока.Строки = СтруктураСерииКоллекция;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для каждого СтрокаНоменклатура Из СписокНоменклатуры Цикл
			
			СтруктураПоиска.НоменклатураСписка = СтрокаНоменклатура.Номенклатура;
			СтруктураПоиска.ХарактеристикаСписка = СтрокаНоменклатура.Характеристика;
			СтруктураПоиска.СерияСписка = СтрокаНоменклатура.Серия;
			
			Для каждого СтрокаСерияМатериала Из ИспользованныеСерии.НайтиСтроки(СтруктураПоиска) Цикл
				
				КоличествоСтрок = КоличествоСтрок + 1;
				Если КоличествоСтрок > ЛимитСтрок Тогда
					ПревышенЛимитСтрок = Истина;
					Прервать;
				КонецЕсли;
				
				НоваяСерия = СтрокаНоменклатура.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСерия, СтрокаСерияМатериала);
				НоваяСерия.НоменклатураПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
					СтрокаСерияМатериала.НоменклатураПредставление,
					СтрокаСерияМатериала.ХарактеристикаПредставление);
					
				Если ЗначениеЗаполнено(НоваяСерия.Серия) Тогда
					
					// Контроль зацикливания
					ЕстьЗацикливание = Ложь;
					
					Родитель = НоваяСерия.Родитель;
					Пока Родитель <> Неопределено Цикл
						Если Родитель.Номенклатура = НоваяСерия.Номенклатура
								И Родитель.Характеристика = НоваяСерия.Характеристика
								И Родитель.Серия = НоваяСерия.Серия Тогда
							ЕстьЗацикливание = Истина;
							Прервать;
						КонецЕслИ;
						Родитель = Родитель.Родитель;
					КонецЦикла;
					
					Если Не ЕстьЗацикливание Тогда
						НоваяНоменклатура = НовыйСписокНоменклатуры.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяНоменклатура, НоваяСерия);
						НоваяНоменклатура.Строки = НоваяСерия.Строки;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла; 
			Если КоличествоСтрок > ЛимитСтрок Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если КоличествоСтрок > ЛимитСтрок Тогда
			Прервать;
		КонецЕсли;
		
		СписокНоменклатуры = НовыйСписокНоменклатуры.Скопировать();
		
	КонецЦикла; 
	
	Возврат СтруктураСерииНоменклатурыДерево;
	
КонецФункции

//#Удаление
	//Функция ИспользованныеСерии(СписокНоменклатуры, ОтборПоХарактеристике)
//#КонецУдаления
//#Встака
	Функция ИспользованныеСерии(СписокНоменклатуры, ОтборПоХарактеристике, Знач ВидЦены)
//#КонецВставки

	ТекстыЗапроса = Новый Массив;
	
	#Область СписокНоменклатуры
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СписокНоменклатуры.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(СписокНоменклатуры.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(СписокНоменклатуры.Серия КАК Справочник.СерииНоменклатуры) КАК Серия
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	&СписокНоменклатуры КАК СписокНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия");
	
	#КонецОбласти
	
	//++ НЕ УТ

	//++ Локализация
	#Область ПоступлениеСерийПриПроизводстве21
	
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.ВыпускПродукции) КАК Документ,
	|	ДвижениеСерии.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииПоВыпуску
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			&ОтборПоСпискуНоменклатуры
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаПродукцииИзПроизводства)
	|				И Документ ССЫЛКА Документ.ВыпускПродукции) КАК ДвижениеСерии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеСерииПоВыпуску.Номенклатура КАК Номенклатура,
	|	ПоступлениеСерииПоВыпуску.Характеристика КАК Характеристика,
	|	ПоступлениеСерииПоВыпуску.Серия КАК Серия,
	|	ТаблицаТовары.Распоряжение КАК Распоряжение,
	|	ПоступлениеСерииПоВыпуску.Количество КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииВыпускПоРаспоряжению
	|ИЗ
	|	ПоступлениеСерииПоВыпуску КАК ПоступлениеСерииПоВыпуску
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ТаблицаДокумента
	|		ПО (ТаблицаДокумента.Ссылка = ПоступлениеСерииПоВыпуску.Документ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.Товары КАК ТаблицаТовары
	|		ПО (ТаблицаТовары.Ссылка = ПоступлениеСерииПоВыпуску.Документ)
	|			И (ТаблицаТовары.Номенклатура = ПоступлениеСерииПоВыпуску.Номенклатура)
	|ГДЕ
	|	ТаблицаДокумента.ВыпускПоРаспоряжениям
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение");
	
	#КонецОбласти
	//-- Локализация

	//-- НЕ УТ
	
	//++ НЕ УТ

	//++ Локализация
	#Область ДокументыПоступленияСерийПриПроизводстве21
	
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РаспределениеЗатратНаВыпускБезРаспоряжений
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспределениеЗатрат.Номенклатура КАК Номенклатура,
	|		РаспределениеЗатрат.Характеристика КАК Характеристика,
	|		РаспределениеЗатрат.Серия КАК Серия,
	|		РаспределениеЗатрат.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.РаспределениеПроизводственныхЗатрат.ВыпускиБезРаспоряжения КАК РаспределениеЗатрат
	|	ГДЕ
	|		&ОтборПоНоменклатуреРаспределениеЗатрат
	|		И РаспределениеЗатрат.Ссылка.Проведен
	|	
	//++ Устарело_Производство21
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеСерииПоВыпуску.Номенклатура,
	|		ПоступлениеСерииПоВыпуску.Характеристика,
	|		ПоступлениеСерииПоВыпуску.Серия,
	|		ТаблицаВыходныеИзделия.Ссылка
	|	ИЗ
	|		ПоступлениеСерииПоВыпуску КАК ПоступлениеСерииПоВыпуску
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеЗатратНаВыпуск.ВыходныеИзделия КАК ТаблицаВыходныеИзделия
	|		ПО ТаблицаВыходныеИзделия.Распоряжение = ПоступлениеСерииПоВыпуску.Документ
	|			И ТаблицаВыходныеИзделия.Номенклатура = ПоступлениеСерииПоВыпуску.Номенклатура
	|			И ТаблицаВыходныеИзделия.Характеристика = ПоступлениеСерииПоВыпуску.Характеристика
	|			И ТаблицаВыходныеИзделия.Ссылка.Проведен) КАК ВложенныйЗапрос
	//-- Устарело_Производство21
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка");
	
	#КонецОбласти
	//-- Локализация

	#Область ПоступлениеСерийПриПроизводстве22
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ДвижениеСерии.Документ КАК Документ
	|ПОМЕСТИТЬ ПоступлениеСерийПриПроизводствеБезЗаказа
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			&ОтборПоСпискуНоменклатуры
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПроизводствоПродукции)
	|				И Документ ССЫЛКА Документ.ПроизводствоБезЗаказа) КАК ДвижениеСерии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ");
	
	
	#КонецОбласти
	
	#Область ПоступлениеСерийПриПроизводствеНаСтороне
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ДвижениеСерии.Документ КАК Документ
	|ПОМЕСТИТЬ ПоступлениеСерийПриПроизводствеНаСтороне
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			&ОтборПоСпискуНоменклатуры
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПроизводствоПродукции)
	|				И ТИПЗНАЧЕНИЯ(Документ) = ТИП(Документ.ОтчетПереработчика2_5)) КАК ДвижениеСерии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ");
	
	#КонецОбласти
	
	//-- НЕ УТ
	
	
	#Область ПоступлениеСерийПриСборке
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.СборкаТоваров) КАК Документ,
//#Вставка
	|	ВЫРАЗИТЬ(СбТ.ЗаказНаСборку КАК Документ.ЗаказНаСборку) КАК ЗаказНаСборку,
//#КонецВставки
	|	ДвижениеСерии.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииПоСборке
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			&ОтборПоСпискуНоменклатуры
	|				И СкладскаяОперация В (ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаСобранныхКомплектов),
	|										ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаКомплектующихПослеРазборки))) КАК ДвижениеСерии
//#Вставка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СбТ
	|		ПО ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.СборкаТоваров) = СбТ.Ссылка
//#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Документ");
	
	#КонецОбласти
	
	#Область РасходСерий
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.НоменклатураСписка КАК НоменклатураСписка,
	|	ВложенныйЗапрос.ХарактеристикаСписка КАК ХарактеристикаСписка, 
	|	ВложенныйЗапрос.СерияСписка КАК СерияСписка,
//#Вставка
	|	ВложенныйЗапрос.Номенклатура.Код КАК НоменклатураКод,
	|" + ?(ЗначениеЗаполнено(ВидЦены), "
	//|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена1,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Цена,
	|	СУММА(ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВложенныйЗапрос.Израсходовано) КАК Сумма,","") + "
//#КонецВставки
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.Серия.Представление КАК СерияПредставление,
	|	СУММА(ВложенныйЗапрос.Израсходовано) КАК Израсходовано
	|ИЗ
	|(
//#Удаление
//	|	ВЫБРАТЬ
//	|		ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
//	|		ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
//	|		ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
//	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
//	|		ИспользованныеСерии.Характеристика КАК Характеристика,
//	|		ИспользованныеСерии.Серия КАК Серия,
//	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
//	|	ИЗ
//	|			РегистрНакопления.ДвиженияСерийТоваров.Обороты(
//	|				,
//	|				,
//	|				,
//	|				Документ В
//	|						(ВЫБРАТЬ
//	|							ПоступлениеСерииПоСборке.Документ
//	|						ИЗ
//	|							ПоступлениеСерииПоСборке)
//	|					И СкладскаяОперация В (ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКомплектующихДляСборки),
//	|											ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКомплектовДляРазборки))) КАК ИспользованныеСерии
//	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
//	|			ПО (ПоступлениеСерииПоСборке.Документ = ИспользованныеСерии.Документ)
//	//++ НЕ УТ
//#КонецУдаления
//#Вставка
	|	ВЫБРАТЬ
	|		ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.ВНаличии КАК Израсходовано
	|	ИЗ
	|			РегистрНакопления.ТоварыНаСкладах КАК ИспользованныеСерии
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
	|			ПО (ПоступлениеСерииПоСборке.Документ = ИспользованныеСерии.Регистратор)
	|	ГДЕ
	|		ИспользованныеСерии.Активность = ИСТИНА
	|		И ИспользованныеСерии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ИспользованныеСерии.Регистратор В
	|						(ВЫБРАТЬ
	|							ПоступлениеСерииПоСборке.Документ
	|						ИЗ
	|							ПоступлениеСерииПоСборке)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	//|	ВЫБРАТЬ
	//|		ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
	//|		ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
	//|		ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
	////|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	//|		ЕСТЬNULL(ТС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	//|		ЕСТЬNULL(ТС.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	//|		ЕСТЬNULL(ТС.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	//|		ВЫБОР 
	//|			КОГДА ЕСТЬNULL(ТС.ВНаличии, 0) = 0 ТОГДА 
	//|           	ИспользованныеСерии.ДоизготовитьРасход
	//|           ИНАЧЕ
	//|				ТС.ВНаличии
	//| 		КОНЕЦ КАК Израсходовано
	//|	ИЗ
	//|			РегистрНакопления.ИТБК_Доизготовление.Обороты(
	//|				,
	//|				,
	//|				Регистратор,
	//|				АктИзготовления В
	//|						(ВЫБРАТЬ
	//|							ПоступлениеСерииПоСборке.ЗаказНаСборку
	//|						ИЗ
	//|							ПоступлениеСерииПоСборке)) КАК ИспользованныеСерии
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
	//|			ПО (ПоступлениеСерииПоСборке.ЗаказНаСборку = ИспользованныеСерии.АктИзготовления)
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТС
	//|			ПО (ТС.Регистратор = ИспользованныеСерии.Регистратор)
	//|				И (ТС.Номенклатура = ИспользованныеСерии.Номенклатура)
	
	//|	ВЫБРАТЬ
	//|		ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
	//|		ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
	//|		ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
	////|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	//|		ЕСТЬNULL(ТС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	//|		ЕСТЬNULL(ТС.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	//|		ЕСТЬNULL(ТС.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	//|		ВЫБОР 
	//|			КОГДА ЕСТЬNULL(ТС.ВНаличии, 0) = 0 ТОГДА 
	//|           	ИспользованныеСерии.ДоизготовитьРасход
	//|           ИНАЧЕ
	//|				ТС.ВНаличии
	//| 		КОНЕЦ КАК Израсходовано
	//|	ИЗ
	//|			РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Обороты(
	//|				,
	//|				,
	//|				Регистратор,
	//|				) КАК ИспользованныеСерии
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
	//|			ПО (ПоступлениеСерииПоСборке.ЗаказНаСборку = ИспользованныеСерии.Регистратор)
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТС
	//|			ПО (ТС.Регистратор = ИспользованныеСерии.Регистратор)
	//|				И (ТС.Номенклатура = ИспользованныеСерии.Номенклатура)
	//|	ГДЕ ИспользованныеСерии.Регистратор В
	//|						(ВЫБРАТЬ
	//|							ПоступлениеСерииПоСборке.ЗаказНаСборку
	//|						ИЗ
	//|							ПоступлениеСерииПоСборке)  
	|		
	|		ВЫБРАТЬ
	|		ВЗ.НоменклатураСписка КАК НоменклатураСписка,
	|		ВЗ.ХарактеристикаСписка КАК ХарактеристикаСписка,
	|		ВЗ.СерияСписка КАК СерияСписка,
	|		ЕСТЬNULL(ТС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|		ЕСТЬNULL(ТС.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|		ЕСТЬNULL(ТС.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|		СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(ТС.ВНаличии, 0) = 0
	|					ТОГДА ВЗ.КоличествоОборот
	|				ИНАЧЕ ТС.ВНаличии
	|			КОНЕЦ) КАК Израсходовано
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
	|			ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
	|			ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
	|			ВП.Ссылка КАК Регистратор,
	|			АУН.Номенклатура КАК Номенклатура,
	|			АУН.Характеристика КАК Характеристика,
	|			ИспользованныеСерии.КоличествоОборот КАК КоличествоОборот
	|		ИЗ
	|			ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотребление КАК ВП
	|				ПО ПоступлениеСерииПоСборке.ЗаказНаСборку = ВП.ИТБК_АктИзготовления
	|					И (ВП.ИТБК_ЭтоДоизготовление)
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотребление.ВидыЗапасов КАК ВПВЗ
	|				ПО (ВП.Ссылка = ВПВЗ.Ссылка)
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Обороты(, , Регистратор, ) КАК ИспользованныеСерии
	|				ПО (ВПВЗ.АналитикаУчетаНоменклатуры = ИспользованныеСерии.АналитикаУчетаНоменклатуры)
	|				И (ВПВЗ.Ссылка = ИспользованныеСерии.Регистратор)
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АУН
	|				ПО (ИспользованныеСерии.АналитикаУчетаНоменклатуры = АУН.Ссылка)
	|		ГДЕ
	|			ВП.ИТБК_АктИзготовления В
	|					(ВЫБРАТЬ
	|						ПоступлениеСерииПоСборке.ЗаказНаСборку
	|					ИЗ
	|						ПоступлениеСерииПоСборке)) КАК ВЗ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТС
	|			ПО (ВЗ.Регистратор = ТС.Регистратор)
	|				И (ВЗ.Номенклатура = ТС.Номенклатура)
	|				И (ВЗ.Характеристика = ТС.Характеристика)
    |
	|	СГРУППИРОВАТЬ ПО
	|		ВЗ.НоменклатураСписка,
	|		ВЗ.ХарактеристикаСписка,
	|		ВЗ.СерияСписка,
	|		ЕСТЬNULL(ТС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|		ЕСТЬNULL(ТС.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|		ЕСТЬNULL(ТС.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	
//#КонецВставки

	//++ Локализация
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РаспределениеЗатратНаВыпускБезРаспоряжений.Номенклатура,
	|		РаспределениеЗатратНаВыпускБезРаспоряжений.Характеристика,
	|		РаспределениеЗатратНаВыпускБезРаспоряжений.Серия,
	|		ИспользованныеСерии.Номенклатура,
	|		ИспользованныеСерии.Характеристика,
	|		ИспользованныеСерии.Серия,
	|		ИспользованныеСерии.КоличествоОборот
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|						(ВЫБРАТЬ
	|							РаспределениеЗатратНаВыпускБезРаспоряжений.Ссылка
	|						ИЗ
	|							РаспределениеЗатратНаВыпускБезРаспоряжений)
	|					И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.СписаниеМатериаловНаЗатраты)) КАК ИспользованныеСерии
	|			ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗатратНаВыпускБезРаспоряжений КАК РаспределениеЗатратНаВыпускБезРаспоряжений
	|			ПО (РаспределениеЗатратНаВыпускБезРаспоряжений.Ссылка = ИспользованныеСерии.Документ)
	//-- Локализация
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Производство без заказа
	|	ВЫБРАТЬ
	|		ПоступлениеСерий.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерий.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерий.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|						(ВЫБРАТЬ
	|							ПоступлениеСерий.Документ
	|						ИЗ
	|							ПоступлениеСерийПриПроизводствеБезЗаказа КАК ПоступлениеСерий)
	|					И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПотреблениеМатериаловПриПроизводстве)) КАК ИспользованныеСерии
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерийПриПроизводствеБезЗаказа КАК ПоступлениеСерий
	|			ПО (ПоступлениеСерий.Документ = ИспользованныеСерии.Документ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение материалов на производство без заказа
	|	ВЫБРАТЬ
	|		ПоступлениеСерий.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерий.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерий.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|					(ВЫБРАТЬ
	|						РаспределениеЗатрат.Ссылка КАК Ссылка
	|					ИЗ
	|						ПоступлениеСерийПриПроизводствеБезЗаказа КАК ПоступлениеСерий
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК РаспределениеЗатрат
	|							ПО
	|								ПоступлениеСерий.Документ = РаспределениеЗатрат.ПартияПроизводства.Документ)) КАК ИспользованныеСерии
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК РаспределениеЗатрат
	|			ПО ИспользованныеСерии.Документ = РаспределениеЗатрат.Ссылка
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерийПриПроизводствеБезЗаказа КАК ПоступлениеСерий
	|			ПО (РаспределениеЗатрат.ПартияПроизводства.Документ = ПоступлениеСерий.Документ)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Производство на стороне
	|	ВЫБРАТЬ
	|		ПоступлениеСерий.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерий.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерий.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|						(ВЫБРАТЬ
	|							ПоступлениеСерий.Документ
	|						ИЗ
	|							ПоступлениеСерийПриПроизводствеНаСтороне КАК ПоступлениеСерий)
	|					И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ДвижениеВФинансовомУчете)
	|			) КАК ИспользованныеСерии
	|			
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерийПриПроизводствеНаСтороне КАК ПоступлениеСерий
	|			ПО (ПоступлениеСерий.Документ = ИспользованныеСерии.Документ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение материалов на производство на стороне
	|	ВЫБРАТЬ
	|		ПоступлениеСерий.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерий.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерий.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|					(ВЫБРАТЬ
	|						РаспределениеЗатрат.Ссылка КАК Ссылка
	|					ИЗ
	|						ПоступлениеСерийПриПроизводствеНаСтороне КАК ПоступлениеСерий
	|						
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК РаспределениеЗатрат
	|						ПО ПоступлениеСерий.Документ = РаспределениеЗатрат.ПартияПроизводства.Документ)
	|			) КАК ИспользованныеСерии
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК РаспределениеЗатрат
	|			ПО ИспользованныеСерии.Документ = РаспределениеЗатрат.Ссылка
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерийПриПроизводствеНаСтороне КАК ПоступлениеСерий
	|			ПО (РаспределениеЗатрат.ПартияПроизводства.Документ = ПоступлениеСерий.Документ)
	//-- НЕ УТ
	|) КАК ВложенныйЗапрос
//#Вставка
	|" + ?(ЗначениеЗаполнено(ВидЦены), "
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|			ПО (ВложенныйЗапрос.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
	|			И (ВложенныйЗапрос.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
	|			ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
	|			ПО (ИСТИНА)","") + "
	|
//#КонецВставки
	|ГДЕ
	|	НЕ(ВложенныйЗапрос.НоменклатураСписка = ВложенныйЗапрос.Номенклатура
	|		И ВложенныйЗапрос.ХарактеристикаСписка = ВложенныйЗапрос.Характеристика
	|		И ВложенныйЗапрос.СерияСписка = ВложенныйЗапрос.Серия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НоменклатураСписка,
	|	ВложенныйЗапрос.ХарактеристикаСписка,
	|	ВложенныйЗапрос.СерияСписка,
//#Вставка
	|	ВложенныйЗапрос.Номенклатура.Код,
	|" + ?(ЗначениеЗаполнено(ВидЦены), "
	//|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ,","") + "
//#КонецВставки
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Серия
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураПредставление,
	|	ХарактеристикаПредставление,
	|	СерияПредставление");
	
	#КонецОбласти
	
	Разделитель = 
	"
	|;
	|/////////////////////////////////////////////////////////////
	|";
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, Разделитель);
	
	Если ОтборПоХарактеристике Тогда
		
		ОтборПоСпискуНенклатуры = 
		"(Номенклатура, Характеристика, Серия) В
		|					(ВЫБРАТЬ
		|						СписокНоменклатуры.Номенклатура,
		|						СписокНоменклатуры.Характеристика,
		|						СписокНоменклатуры.Серия
		|					ИЗ
		|						СписокНоменклатуры)";
		
		ОтборПоНоменклатуреРаспределениеЗатрат = 
		"(РаспределениеЗатрат.Номенклатура, РаспределениеЗатрат.Характеристика, РаспределениеЗатрат.Серия) В
		|					(ВЫБРАТЬ
		|						СписокНоменклатуры.Номенклатура,
		|						СписокНоменклатуры.Характеристика,
		|						СписокНоменклатуры.Серия
		|					ИЗ
		|						СписокНоменклатуры КАК СписокНоменклатуры)";
		
	Иначе
		
		ОтборПоСпискуНенклатуры = 
		"(Номенклатура, Серия) В
		|					(ВЫБРАТЬ
		|						СписокНоменклатуры.Номенклатура,
		|						СписокНоменклатуры.Серия
		|					ИЗ
		|						СписокНоменклатуры)";
		
		ОтборПоНоменклатуреРаспределениеЗатрат = 
		"(РаспределениеЗатрат.Номенклатура, РаспределениеЗатрат.Серия) В
		|					(ВЫБРАТЬ
		|						СписокНоменклатуры.Номенклатура,
		|						СписокНоменклатуры.Серия
		|					ИЗ
		|						СписокНоменклатуры КАК СписокНоменклатуры)";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ОтборПоСпискуНоменклатуры",
		ОтборПоСпискуНенклатуры);
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ОтборПоНоменклатуреРаспределениеЗатрат",
		ОтборПоНоменклатуреРаспределениеЗатрат);
//#Вставка
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения",
			"ВложенныйЗапрос.Номенклатура"));
//#КонецВставки
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
//#Вставка
	БазоваяВалюта = Справочники.Валюты.НайтиПоКоду("643");
	Запрос.УстановитьПараметр("Валюта", БазоваяВалюта);
	Запрос.УстановитьПараметр("БазоваяВалюта", БазоваяВалюта);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
//#КонецВставки
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьСтрокиРекурсивно(СтруктураСерииДерево, ОбластьСтрока, Уровень, ДокументРезультат)

	Для каждого СтрокаДерева Из СтруктураСерииДерево.Строки Цикл
		
//#Удаление
//		ПараметрыОбласти = Новый Структура("Номенклатура,Серия,НоменклатураПредставление,
//		|СерияПредставление,ЕдиницаИзмерения,Израсходовано");
//#КонецУдаления
//#Вставка
		ПараметрыОбласти = Новый Структура("НоменклатураКод,Номенклатура,Серия,НоменклатураПредставление,
		|СерияПредставление,ЕдиницаИзмерения,Израсходовано,Цена,Сумма");
//#КонецВставки
		ЗаполнитьЗначенияСвойств(ПараметрыОбласти, СтрокаДерева);
		
//#Удаление
//		СтруктураРасшифровки = Новый Структура("Номенклатура,Характеристика,Серия");
//#КонецУдаления
//#Вставка
		СтруктураРасшифровки = Новый Структура("НоменклатураКод,Номенклатура,Характеристика,Серия");
//#КонецВставки
		ЗаполнитьЗначенияСвойств(СтруктураРасшифровки, СтрокаДерева);
		
		ПараметрыОбласти.Вставить("СтруктураРасшифровки", СтруктураРасшифровки);
		
		ОбластьСтрока.Параметры.Заполнить(ПараметрыОбласти);
		ДокументРезультат.Вывести(ОбластьСтрока, Уровень,, Истина);
		
		ЗаполнитьСтрокиРекурсивно(СтрокаДерева, ОбластьСтрока, Уровень + 1, ДокументРезультат);
		
	КонецЦикла; 
	
КонецПроцедуры

Функция ЛимитСтрок()
	Возврат 100000;
КонецФункции

Процедура ОбработатьСтрокиД(СтрокиД)
	СтрокиИ=СтрокиД.НайтиСтроки(Новый Структура("Сумма",0));
	Если СтрокиИ.Количество() Тогда
		Для каждого СтрокаД Из СтрокиИ Цикл
			//Если СтрокаД.Сумма=0 Тогда
			ОбработатьСтрокиД(СтрокаД.Строки);
			СтрокаД.Сумма = СтрокаД.Строки.Итог("Сумма");
		    СтрокаД.Цена = СтрокаД.Сумма / ?(СтрокаД.Израсходовано=0,1,СтрокаД.Израсходовано);
			//КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
